<template>
	<v-card max-width="auto" title="Функционал редактора">
		<template v-slot:text>
			<v-tabs v-model="tab" class="mt-1 mb-6" density="compact">
				<v-tab value="base">Время</v-tab>
				<v-tab value="timeblock">Время</v-tab>
				<v-tab value="linebreak">Перенос строки</v-tab>
				<v-tab value="settings">Настройки</v-tab>
				<v-tab value="auto-save">Сохранение</v-tab>
				<v-tab value="hotkeys">Горячие клавиши</v-tab>
			</v-tabs>

			<v-tabs-window v-model="tab">
				<!-- base -->
				<v-tabs-window-item value="base">
					<p>
						Любые взаимодействия с расписанием происходят при активной кнопке
						"Режим редактирования"
					</p>
					<p>По умолчанию, дата выставится на дату следующего дня.</p>
					<p>
						Чтобы изменить - необходимо выставить ее в правой-верхней части
						карточки в формате ДД.ММ, день недели затем сменится автоматически.
					</p>
					<p>
						Для добавление/удаления строк в конец списка существуют кнопки "+" и
						"-".
					</p>
					<p>
						Так же, справа имеется кнопка "Нет сеансов". Она изменяет содержимое
						дня на фразу "В этот день сеансов нет". Для ее замены -
						воспольузйтесь настройками.
					</p>
					<p>
						Кнопка "-" по умолчанию удалит последнюю строку. Для удаления
						конкретной строки - наведите на фильм, справа появится кнопка
						"Удалить строку"
					</p>

					<p>
						В редакторе имеется возможность ставить в одну запись фильма
						несколько времен сеанса. Для ознакомления, переключите вкладку
						обучения на "Время"
					</p>
				</v-tabs-window-item>
				<!-- End of base -->

				<!-- timeblock -->
				<v-tabs-window-item value="timeblock">
					<p>Время сеансов можно группировать в одной ячейке.</p>
					<p>
						Для этого, в графе минут нажмите Enter, чтобы создать новую ячейку
						времени.
					</p>
					<p>
						Для удаления ячейки - нажмите Backspace в графе часов в
						дополнительно созданной ячейке.
					</p>
				</v-tabs-window-item>
				<!-- End of timeblock -->

				<!-- linebreak -->
				<v-tabs-window-item value="linebreak">
					<p>
						Если блок дня слишком длинный, он автоматически перенесется в новую
						колонку
					</p>
					<p>
						Чтобы создать "перенос", разбив блок на две части, наведите на
						фильм, справа у него появится кнопка "Создать перенос строки".
						Нажмите на нее, и перенос будет создан
					</p>
					<p>
						Для удаления переноса, у нового созданного блока будет кнопка
						"соединить обратно", справа от дня недели
					</p>
				</v-tabs-window-item>
				<!-- End of linebreak -->

				<!-- settings -->
				<v-tabs-window-item value="settings">
					<p>
						Приложение можно настраивать под себя, изменяя разные настройки.
					</p>
					<p>
						Можно изменять цену по умолчанию, текст отсутствия сеансов, разные
						размеры шрифтов, а так же, текст с контактами.
					</p>
				</v-tabs-window-item>

				<!-- auto-save -->
				<v-tabs-window-item value="auto-save">
					<p>
						Приложение автоматически сохраняет прогресс раз в 15 секунд. Горячие
						клавиши так же сохраняются
					</p>
				</v-tabs-window-item>

				<!-- hotkeys -->
				<v-tabs-window-item value="hotkeys">
					<p>В панели навигации имеется кнопка "горячих клавиш"</p>
					<p>
						В ней можно указать данные в следующем формате: название фильма,
						возрастное ограничение (число), возможность оплаты по Пушкинской
						Карте (галочка), цена
					</p>
					<p>
						Для применения, необходимо выделить текстовое поле, куда
						устанавливается название фильма, и нажать соответсвующую горячую
						клавишу (например, Alt+1)
					</p>
				</v-tabs-window-item>
			</v-tabs-window>
		</template>
		<template v-slot:actions>
			<!-- <v-btn text="Удалить" @click="clearSchedule"></v-btn> -->
			<v-btn text="Назад" @click="$emit('close')"></v-btn>
		</template>
	</v-card>
</template>

<script lang="ts">
import { defineComponent, ref } from 'vue';

export default defineComponent({
	emits: ['close'],
	setup() {
		const tab = ref();
		return { tab };
	},
});
</script>

<style scoped></style>
